import React from "react";
import "./Agreement.css";

const Agreement = (props) => {
    return (
        <div className="layout">
            <h1>Пользовательское Соглашение</h1>
            <p>Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между ИП Рубцов Владимир Александрович (далее Domafound или Администрация) с одной стороны и пользователем сайта с другой.
                Сайт Domafound не является средством массовой информации.
            </p>
            <p>
                Используя сайт, Вы соглашаетесь с условиями данного соглашения.
                Если Вы не согласны с условиями данного соглашения, не используйте сайт Domafound!
            </p>

            <h2>Права и обязанности сторон</h2>

            <p><strong>Пользователь имеет право:</strong></p>
            <p>- осуществлять поиск информации на сайте</p>
            <p>- получать информацию на сайте</p>
            <p>- копировать информацию на другие сайты с указанием источника</p>
            <p>- требовать от администрации скрытия любой информации переданной пользователем сайту</p>
            <p>- использовать информацию сайта в коммерческих целях без специального разрешения</p>

            <p><strong>Администрация имеет право:</strong></p>
            <p>- по своему усмотрению и необходимости создавать, изменять, отменять правила</p>
            <p>- ограничивать доступ к любой информации на сайте</p>
            <p>- создавать, изменять, удалять информацию</p>
            <p>- удалять учетные записи</p>

            <p><strong>Пользователь обязуется:</strong></p>
            <p>- не нарушать работоспособность сайта</p>
            <p>- не создавать несколько учётных записей на Сайте, если фактически они принадлежат одному и тому же лицу</p>
            <p>- не совершать действия, направленные на введение других Пользователей в заблуждение</p>
            <p>- не передавать в пользование свою учетную запись и/или логин и пароль своей учетной записи третьим лицам</p>
            <p>- не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</p>

            <p><strong>Администрация обязуется:</strong></p>
            <p>- поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам.</p>

            <h2>Ответственность сторон</h2>
            <p>- администрация не несет никакой ответственности за достоверность информации, скопированной из других источников</p>
            <p>- администрация не несёт ответственность за несовпадение ожидаемых Пользователем и реально полученных услуг</p>
            <p>- администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</p>
            <p>- в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</p>

            <h2>Условия действия Соглашения</h2>
            <p>Данное Соглашение вступает в силу при любом использовании данного сайта.</p>
            <p>Соглашение перестает действовать при появлении его новой версии.</p>

            <p>Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.
                Администрация не оповещает пользователей об изменении в Соглашении.</p>

            <p>Соглашение разработано на базе юридических документов сервиса Правилль</p>

                <h2>Приложение 1</h2>
                <p>После регистрации Пользователю предоставляется 3 часа полного доступа к сервису бесплатно, а именно:</p>
                <p>*Возможность просматривать всю информацию об объявлениях</p>

                <p><strong>Тарифные планы:</strong></p>
                <p>1) 7 дней доступа - 700 руб</p>
                <p>2) 14 дней доступа - 1300 руб</p>
                <p>3) 21 день доступа - 1900 руб</p>
                <p>4) 31 день доступа - 2500 руб</p>

                <p>Так же существует слайдер, по которому можно выбрать нужное количество дней пользователю.</p>
                <p>Администрация сайта оставляет за собой возможность вносить изменения в тарифные планы.</p>

        </div>
    )
}

export default Agreement;